ERM/src/Documents/КорректировкаТранзакции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>КорректировкаТранзакции</Name>
			<BasedOn>
				<xr:Item>Document.ТранзакцияHOB</xr:Item>
				<xr:Item>Document.ТранзакцияOracle</xr:Item>
				<xr:Item>Document.ПроводкаDSS</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.BilledAR</xr:Item>
				<xr:Item>AccumulationRegister.Payments</xr:Item>
				<xr:Item>AccumulationRegister.UnallocatedCash</xr:Item>
				<xr:Item>AccumulationRegister.UnallocatedMemo</xr:Item>
				<xr:Item>AccumulationRegister.Revenue</xr:Item>
				<xr:Item>AccumulationRegister.ManualTransactions</xr:Item>
				<xr:Item>AccumulationRegister.UnbilledAR</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПроводкаDSS</v8:Type>
						<v8:Type>cfg:DocumentRef.ТранзакцияOracle</v8:Type>
						<v8:Type>cfg:DocumentRef.ТранзакцияHOB</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Oracle</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LegalEntity</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LegalEntiites</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДетализацияПоКлиенту</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Client</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>BaseAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERM/src/Enums/ТипыСоответствий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыСоответствий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Lawson</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OracleSmith</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OracleMI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HOBs</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьCRM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьParentClients</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sun</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ERM/src/Documents/КорректировкаТранзакции/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// { RGS TAlmazova 02.08.2017 17:03:51 - проверка наличия корректировки для транзакции
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КорректировкаТранзакции.Номер
		|ИЗ
		|	Документ.КорректировкаТранзакции КАК КорректировкаТранзакции
		|ГДЕ
		|	НЕ КорректировкаТранзакции.ПометкаУдаления
		|	И КорректировкаТранзакции.ДокументОснование = &ДокументОснование
		|	И КорректировкаТранзакции.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ДокументОснование);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() <> 0 Тогда
		ВыборкаДетальныеЗаписи.Следующий();
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("For this transaction adjustments already. Mark the deletion of the previous adjustment (№"+ ВыборкаДетальныеЗаписи.Номер + ") before creating a new one.");
	КонецЕсли;
	// } RGS TAlmazova 02.08.2017 17:03:51 - проверка наличия корректировки для транзакции
	
	
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ПроводкаDSS") Тогда
		Source = Перечисления.ТипыСоответствий.Lawson;
	ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ТранзакцияHOB") Тогда
		Source = Перечисления.ТипыСоответствий.HOBs;
	Иначе
		Source = Объект.ДокументОснование.Source;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ЗначенияРеквизитовТранзакции = ПолучитьРеквизитыТранзакции();
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ЗначенияРеквизитовТранзакции);
		Если Параметры.Ключ.Пустая() Тогда
			//Объект.Client = ТранзакцияClient;
			Объект.Account = ТранзакцияAccount;
			Объект.Company = ТранзакцияCompany;
			Объект.Location = ТранзакцияLocation;
			Объект.SubSubSegment = ТранзакцияSubSubSegment;
			Объект.Currency = ТранзакцияCurrency;
			Объект.AU = ТранзакцияAU;
			Объект.LegalEntity = ТранзакцияLegalEntity;
			СтрокаКлиент = Объект.ДетализацияПоКлиенту.Добавить();
			СтрокаКлиент.Client = ТранзакцияClient;
			СтрокаКлиент.Amount = ЗначенияРеквизитовТранзакции.ТранзакцияAmount;
			СтрокаКлиент.BaseAmount = ЗначенияРеквизитовТранзакции.ТранзакцияBaseAmount;
		КонецЕсли;
		
		//Если Source = ПредопределенноеЗначение("Перечисление.ТипыСоответствий.OracleMI") или Source = ПредопределенноеЗначение("Перечисление.ТипыСоответствий.OracleSmith") Тогда
		//	 Элементы.ГруппаAU.Видимость = Ложь;
		//Иначе
		//	 Элементы.ГруппаAU.Видимость = Истина;
		//КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРеквизитыТранзакции()
	Возврат Документы.КорректировкаТранзакции.ПолучитьРеквизитыТранзакции(Объект.ДокументОснование);
КонецФункции

&НаКлиенте
Процедура ClientПриИзменении(Элемент)
	
	//ДокументОснованиеClient = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ДокументОснование, "Client");
	ИзменитьФон(Объект.Client, ЭтаФорма.ТранзакцияClient, Элементы.Client);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФон(РеквизитДокумента, РеквизитТранзакции, ЭлементФормы)
	
	Если РеквизитДокумента <> РеквизитТранзакции Тогда
		 ЭлементФормы.ЦветФона = WebЦвета.СветлоРозовый;
	 Иначе
		 ЭлементФормы.ЦветФона = Новый Цвет();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура CompanyПриИзменении(Элемент)
	
	ИзменитьФон(Объект.Company, ЭтаФорма.ТранзакцияCompany, Элементы.Company);
	
КонецПроцедуры

&НаКлиенте
Процедура LocationПриИзменении(Элемент)
	
	ИзменитьФон(Объект.Location, ЭтаФорма.ТранзакцияLocation, Элементы.Location);
	
КонецПроцедуры

&НаКлиенте
Процедура LegalEntityПриИзменении(Элемент)
	
	ИзменитьФон(Объект.LegalEntity, ЭтаФорма.ТранзакцияLegalEntity, Элементы.LegalEntity);
	
КонецПроцедуры

&НаКлиенте
Процедура SubSubSegmentПриИзменении(Элемент)
	
	ИзменитьФон(Объект.SubSubSegment, ЭтаФорма.ТранзакцияSubSubSegment, Элементы.SubSubSegment);
	
КонецПроцедуры

&НаКлиенте
Процедура AccountПриИзменении(Элемент)
	
	ИзменитьФон(Объект.Account, ЭтаФорма.ТранзакцияAccount, Элементы.Account);
	
КонецПроцедуры

&НаКлиенте
Процедура CurrencyПриИзменении(Элемент)
	
	ИзменитьФон(Объект.Currency, ЭтаФорма.ТранзакцияCurrency, Элементы.Currency);
	
КонецПроцедуры

&НаКлиенте
Процедура AUПриИзменении(Элемент)
	
	ИзменитьФон(Объект.AU, ЭтаФорма.ТранзакцияAU, Элементы.AU);
	
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПоКлиентуПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	//Чтобы строка не добавлялась, так как добавление внутри распределения суммы
	Отказ = Истина;
	
	РаспределитьСумму();

КонецПроцедуры

&НаСервере
Процедура РаспределитьСумму()
	
	ЗначенияРеквизитовТранзакции = ПолучитьРеквизитыТранзакции();
	ОстатокСуммы = ЗначенияРеквизитовТранзакции.ТранзакцияAmount - Объект.ДетализацияПоКлиенту.Итог("Amount");
	Если ОстатокСуммы <> 0 Тогда
		ТабличнаяЧастьДокумента = Объект.ДетализацияПоКлиенту.Выгрузить();
		НоваяСтрока = ТабличнаяЧастьДокумента.Добавить();
		НоваяСтрока.Amount = ОстатокСуммы; 
		ТаблицаСумм = ТабличнаяЧастьДокумента.ВыгрузитьКолонку("Amount");
		Если (ЗначенияРеквизитовТранзакции.ТранзакцияBaseAmount) <> 0 Тогда
			ТаблицаСуммВалюта = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ЗначенияРеквизитовТранзакции.ТранзакцияBaseAmount, ТаблицаСумм);
			ТабличнаяЧастьДокумента.ЗагрузитьКолонку(ТаблицаСуммВалюта, "BaseAmount");
		КонецЕсли;
		Объект.ДетализацияПоКлиенту.Загрузить(ТабличнаяЧастьДокумента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияПоКлиентуAmountПриИзменении(Элемент)
	
	Если ТранзакцияCurrency = Объект.Currency Тогда
		РаспределитьСумму();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	СтруктураОповещения = Новый Структура;
	СтруктураОповещения.Вставить("Корректировка", Объект.Ссылка);
	СтруктураОповещения.Вставить("ПометкаУдаления", Объект.ПометкаУдаления);
	
	Оповестить("ЗаписьКорректировки", СтруктураОповещения);

КонецПроцедуры
